using System;
using System.Collections.Generic;
using System.Globalization;
using System.Threading;

class DatesExtract
{
    static string someText = "04.09.1869 прима се, че тогава е основан Българският Революционен Централен Комитет (БРЦК) в Букурещ.\n" +
    "11.02.1870 издаден е султански ферман, с който се прокламира учредяването на българската екзархия.\n" +
    "27.12.1872 заловен е Васил Левски от турските власти.\n" +
    "06.02.1873 Васил Левски е обесен край София.\n" +
    "08.12.1874 излиза вестник Знаме, редактиран от Христо Ботев.\n" +
    "20.04.1876 обявено Априлското въстание в Копривщица.\n" +
    "01.06.1876 загива Христо Ботев.\n" +
    "12.04.1877 Русия обявява война на Турция, начало на Руско-турската освободителна война.\n" +
    "19.02.1878 подписан е Санстефанският прелиминарен договор, с който се слага край на Руско-турската освободителна война.\n" +
    "01.07.1878 подписан е Берлинският договор, по силата на който е разпокъсана на няколко части току-що освободената българска държава.\n" +
    "05.10.1879 Кресненско-Рзложко въстание против несправедливите решения на Берлинския конгрес.\n" +
    "16.04.1879 Учредителното събрание приема първата българска конституция Търновската.\n" +
    "17.04.1879 принц Александър Батемберг е избран от първото Велико народно събрание за български княз.\n" +
    "06.09.1885 обявено Съединението на Източна Румелия и Княжество България.\n" +
    "02.10.1885 избухва Сръбско-българската война.\n" +
    "25.06.1887 принц Фердинанд Сакскобургготски избран от третото Велико народно събрание за български княз.\n" +
    "20.07.1903 обявявяване на Илинденско-Преображенското въстание в Битолския революционен окръг.\n";

    static void Main()
    {
        string[] dividerBySpace = someText.Split(' ', ',', '-', ':', '\n');

        List<DateTime> dates = new List<DateTime>();
        for (int i = 0; i < dividerBySpace.Length; i++)
        {
            dividerBySpace[i] = dividerBySpace[i].Trim(' ', '.', '!', '?', '>', ',', ')', '('); 
            try
            {
                dates.Add(DateTime.ParseExact(dividerBySpace[i], "dd.MM.yyyy", CultureInfo.InvariantCulture));
            }
            catch (FormatException)
            {
                continue;
                // throw new FormatException();
            }
        }

        Thread.CurrentThread.CurrentCulture = new CultureInfo("fr-CA");

        foreach (var date in dates)
        {
            Console.WriteLine("{0:yyyy-MM-dd}", date);
        }
    }
}

